/* s массивын элементүүдийг 2-оос 20 хүртэлх тэгш бүхэл тоогоор дүүргэх */
#include <stdio.h>
#define SIZE 10
 
int main(){   
   /* тогтмол SIZE нь массивын хэмжээг зааж өгөх боломжтой */
   int s[ SIZE ]; /* s массив нь 10 элемент хадгалах багтаамжтай. */
   int j; /* тоолуур хувьсагч */
 
   for ( j = 0; j < SIZE; j++ ) { /* массивын элементэд утга оноох */
      s[ j ] = 2 + 2 * j;
   }
 
   printf( "%s%13s\n", "Element", "Value" );
 
   /* массивын элементүүдийг хэвлэх */
   for ( j = 0; j < SIZE; j++ ) {   
      printf( "%7d%13d\n", j, s[ j ] );
   }
 
   return 0;  
}
