#include <stdio.h>

int square( int y ); /* функцийн загвар */
 
/* үндсэн функц нь программын гүйцэтгэлийг эхлүүлнэ */
int main() {
   int x; /* тоологч хувьсагч */
 
   /* 10 удаа давтаж, х-ийн квадратыг тооцоолж гарга */
   for ( x = 1; x <= 10; x++ ) {
      printf( “ %d ”, square( x ) ); /* функц дуудах*/
   } /* for давталтын төгсгөл */
 
   printf( "\n" );
 
   return 0; /* амжилттай дууссаныг илтгэнэ */
 } /* main функцийн төгсгөл */
 
/* квадрат функцийн тодорхойлолт нь параметрийн квадратыг буцаана */
int square( int y ) /* y нь функцийн аргумент */
{
   return y * y; /* y-ийн квадратыг int хэлбэрээр буцаана */
} /* square нэртэй функцийн төгсгөл */
